app/controllers/concerns/methods.rb

SELECT  "attendances".* FROM "attendances" WHERE "attendances"."user_id" = ? AND "attendances"."work_date" = ? LIMIT ?  [["user_id", "Uce5a9862329ea5b26d4d02cf0b0b6a93"], ["work_date", "2020-11-30"], ["LIMIT", 1]]
---
def show_today_record(event)
    user_id = event['source']['userId']
    today = Date.today
    record =  Attendance.where(user_id: "#{user_id}", work_date: "#{today}").take

SELECT "attendances".* FROM "attendances" WHERE "attendances"."user_id" = ? AND (work_date like '2020-11%')  [["user_id", "Uce5a9862329ea5b26d4d02cf0b0b6a93"]]
---
def show_this_month_record(event)
    user_id = event['source']['userId']
    this_month = Date.today.strftime("%Y-%m")
    records =  Attendance.where(user_id: "#{user_id}").where('work_date like ?',"#{this_month}%")